font_table_fx999cncw = {
    '--': [
        ['𝒙 ', '𝒚 ', '𝒛 ', '… ', '▲ ', '▼ ', '▸ ', '₋ ', '$ ', '◁ ', '& ', '𝑡 ', 'ᴛ ', 'ₜ ', 'ₕ ', '₅ '],
        ['  ', '! ', '" ', '# ', '× ', '% ', '÷ ', "' ", '( ', ') ', '⋅ ', '+ ', ', ', '- ', '. ', '/ '],
        ['0 ', '1 ', '2 ', '3 ', '4 ', '5 ', '6 ', '7 ', '8 ', '9 ', ': ', '; ', '< ', '= ', '> ', '? '],
        ['@ ', 'A ', 'B ', 'C ', 'D ', 'E ', 'F ', 'G ', 'H ', 'I ', 'J ', 'K ', 'L ', 'M ', 'N ', 'O '],
        ['P ', 'Q ', 'R ', 'S ', 'T ', 'U ', 'V ', 'W ', 'X ', 'Y ', 'Z ', '[ ', '▫ ', '] ', '^ ', '_ '],
        ['− ', 'a ', 'b ', 'c ', 'd ', 'e ', 'f ', 'g ', 'h ', 'i ', 'j ', 'k ', 'l ', 'm ', 'n ', 'o '],
        ['p ', 'q ', 'r ', 's ', 't ', 'u ', 'v ', 'w ', 'x ', 'y ', 'z ', '{ ', '| ', '} ', '~ ', '├ '],
        ['𝒊 ', '𝒆 ', ' ', ' ', ' ', '° ', 'ʳ ', 'ᵍ ', '∠ ', ' ', ' ', ' ', ' ', '→ ', '∏ ', '⇒ '],
        [' ', ' ', ' ', '⌟ ', '≤ ', '≠ ', '≥ ', ' ', '√ ', '∫ ', 'ᴀ ', 'ʙ ', 'ᴄ ', 'ₙ ', '▶ ', '◀ '],
        ['⁰ ', '¹ ', '² ', '³ ', '⁴ ', '⁵ ', '⁶ ', '⁷ ', '⁸ ', '⁹ ', ' ', ' ', ' ', '₍ ', '₎ ', ' '],
        ['₀ ', '₁ ', '₂ ', ' ', 'ꜰ ', 'ɴ ', 'ᴘ ', ' ', '𝗔 ', '𝗕 ', '𝗖 ', '𝗗 ', '𝗘 ', '𝗙 ', '𝗣 ', '▷ '],
        ['∑ ', '𝛼 ', '𝛾 ', '𝜀 ', '𝜃 ', '𝜆 ', '𝜇 ', '𝜋 ', '𝜎 ', '𝜙 ', 'ℓ ', 'ℏ ', '▮ ', '▯ ', '₃ ', '＿'],
        ['𝐟 ', '𝐩 ', '𝐧 ', '𝝁 ', '𝐦 ', '𝐤 ', '𝐌 ', '𝐆 ', '𝐓 ', '𝐏 ', '𝐄 ', '𝐹 ', 'ₚ ', 'ₑ ', 'ᴊ ', 'ᴋ '],
        [' ', ' ', '₉ ', 'Å ', 'ₘ ', 'ɪ ', '₄ ', ' ', ' ', '∟ ', '⟲ ', '↻ ', 'ⁿ ', ' ', ' ', ' '],
    ],
    'F0': [
        [' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '尺', '寸', '分', '間'],
        ['町', '里', '海', '丈', '毛', '厘', '歩', '勺', '坪', '畝', '反', '升', '合', '斗', '石', '貫'],
        ['匁', '斤', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' '],
        [' ', ' ', ' ', ' ', ' ', ' ', ' '],
    ],
    'F1': [
        ['中', '文', '计', '算', '复', '数', '统', '分', '布', '基', '方', '程', '函', '矩', '阵', '表'],
        ['格', '向', '量', '验', '证', '比', '例', '不', '等', '式', '递', '归', '列', '据', '公', '输'],
        ['入', '出', '角', '度', '单', '位', '显', '示', '结', '果', '循', '环', '小', '点', '字', '隔'],
        ['符', '简', '化', '工', '号', '自', '动', '关', '闭', '电', '源', '语', '言', '多', '行', '对'],
        ['当', '前', '频', '学', '线', '性', '弧', '百', '带', '假', '开', '句', '逗', '手', '钟', '普'],
        ['通', '体', '深', '浅', '范', '围', '始', '值', '终', '止', '步', '长', '真', '继', '续', '正'],
        ['态', '概', '率', '密', '累', '积', '反', '二', '项', '泊', '松', '变', '选', '择', '类', '型'],
        ['编', '辑', '双', '回', '清', '除', '存', '储', '器', '插', '全', '部', '删', '下', '限', '上'],
        ['区', '域', '逆', '求', '和', '最', '大', '面', '质', '时', '间', '速', '加', '力', '压', '卡'],
        ['路', '里', '功', '热', '温', '粘', '运', '磁', '光', '放', '射', '吸', '收', '剂', '照', '用'],
        ['常', '原', '子', '与', '核', '物', '理', '采', '其', '他', '键', '断', '法', '错', '误', '堆'],
        ['栈', '维', '无', '解', '超', '空', '转', '到', '联', '立', '未', '知', '个', '次', '穷', '实'],
        ['根', '所', '有', '设', '置', '初', '是', '取', '消', '按', '。', '的', '返', '科', '规', '曲'],
        ['辐', '共', '轭', '提', '虚', '阶', '梯', '形', '均', '两', '成', '内', '定', '义', '能', '差'],
    ],
    'F2': [
        ['偏', '盒', '流', '引', '元', '素', '周', '期', '重', '镧', '系', '锕', '填', '充', '剪', '切'],
        ['贴', '制', '新', '抓', '可', '节', '碼', '版', '本', '支', '持', '嵌', '套', '轴', '移', '旋'],
        ['往', '笔', '抬', '为', '指', '询', '问', '并', '配', '注', '释', '待', '直', '至', '如', '则'],
        ['否', '束', '执', '像', '背', '景', '网', '样', '箭', '头', '十', '标', '记', '以', '创', '建'],
        ['局', '泛', '析', '坐', '六', '进', '三', '换', '导', '乘', '余', '然', '排', '组', '合', '随'],
        ['机', '整', '约', '倍', '绝', '四', '舍', '五', '极', '秒', '亳', '微', '纳', '皮', '飞', '千'],
        ['兆', '吉', '太', '拍', '艾', '目', '准', '因', '调', '平', '序', '升', '降', '叉', '启', '确'],
        ['相', '容', '过', '认', '八', '更', '改', '逻', '缀', '掷', '骰', '抛', '硬', '币', '圆', '同'],
        ['一', '视', '窗', '刻', '心', '半', '撤', '退', '枚', '具', '强', '代', '赋', '剩', '夹', '码'],
    ],
}

chars_table = {
    'A': 'RRR',
    'B': 'RRR$',
    'C': 'RRRR',
    'D': 'RRRR$',
    'E': 'RRRRR',
    'F': 'RRRRR$'
}

print('为 Casio fx-999CN CW VerB 编写的拼字按键生成器 v0.0.1')
print('所有能够显示的字如下：')
print('注：终端中的显示很大概率与实际不符，建议仅查看中文字形，请至 https://h.20142022.xyz/2-level-font/ 查阅正确字形\n')
for i in ['--', 'F0', 'F1', 'F2']:
    print(i + ' 0 1 2 3 4 5 6 7 8 9 A B C D E F')
    for j in range(1, len(font_table_fx999cncw[i]) + 1):
        print(hex(j)[2:].upper() + '  ' + ''.join(font_table_fx999cncw[i][j - 1]))
    print()

text = input('请输入文本 > ')
hexs = ''
chars = ''
nums = ''
keys = 'ww|LE|E|“|W”\nLR|R|R|`R||``E|||C\n5a6Bw|E$o!oTR|EE|$aR!$\n'

for i in text:
    thex = ''
    for j in ['--', 'F0', 'F1', 'F2']:
        for k in range(len(font_table_fx999cncw[j])):
            if i in font_table_fx999cncw[j][k]:
                thex = (j if j != '--' else '') + hex(k + 1)[2:] + hex(font_table_fx999cncw[j][k].index(i))[2:]
                break
            elif i + ' ' in font_table_fx999cncw[j][k]:
                thex = (j if j != '--' else '') + hex(k + 1)[2:] + hex(font_table_fx999cncw[j][k].index(i + ' '))[2:]
                break
    if thex != '':
        hexs = hexs + thex.upper() + ' '

for i in hexs:
    if 65 <= ord(i) <= 70:
        chars = i + chars
        nums += '$'
    elif 48 <= ord(i) <= 57:
        nums += i
chars = chars + 'CBDEBAAE'

keys = keys + '以下开头为数字且后方有空格的几行开头的数字仅作标识作用，不用按\n'

n = 1
keys = keys + str(n) + '      TEEEE|RR|' + chars_table[chars[0]] + '|$$$oo!o!!$\n'
n += 1
for i in chars[1:]:
    keys = keys + str(n) + '      TEEEE|RR|' + chars_table[i] + '|!9o!$\n'
    n += 1

keys = \
    keys + \
    '%$$!o$.30966$00009796$596206$TEE|R|TEE||$.0030$10300$396$19600TEE|R$|TEE||1.\n' + \
    nums + '\n' \
    '&TEE|RR|\n' + \
    '此时请多次按下B，直到屏幕右上角的似暂停号的符号消失。之后请多次按下E直到屏幕上出现六分之五。\n' + \
    '$o!oTR|EE|$aR!$T&&R|&&|&E|ER$1o!oo!o0000000000T&|&|QR|0k30B\n'

print(keys)

output = input('请输入输出文件名 > ')
with open(output, 'w') as f:
    f.write(keys)
